## Staging: common
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.priority-bulk-not-being-processed-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "priority-bulk-not-being-processed-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Priority batch saving are being created but are not being processed fast enough. Difference > 100 for 5 minutes"
      + alarm_name                            = "priority-bulk-buffer-not-being-processed-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-ok",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "priority_bulk_created"
          + label       = "Priority bulk created"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "created"  = "True"
                  + "priority" = "priority"
                }
              + metric_name = "priority_batch_saving_bulk"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "priority_bulk_processed"
          + label       = "Priority bulk processed"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "acknowledged" = "True"
                  + "priority"     = "priority"
                }
              + metric_name = "priority_batch_saving_bulk"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ABS(priority_bulk_created - priority_bulk_processed)"
          + id          = "priority_delta"
          + label       = "Priority delta"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.priority-bulk-not-being-processed-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "priority-bulk-not-being-processed-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Priority batch saving are being created but are not being processed fast enough. Difference > 50 for 5 minutes"
      + alarm_name                            = "priority-bulk-buffer-not-being-processed-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-ok",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "priority_bulk_created"
          + label       = "Priority bulk created"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "created"  = "True"
                  + "priority" = "priority"
                }
              + metric_name = "priority_batch_saving_bulk"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "priority_bulk_processed"
          + label       = "Priority bulk processed"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "acknowledged" = "True"
                  + "priority"     = "priority"
                }
              + metric_name = "priority_batch_saving_bulk"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ABS(priority_bulk_created - priority_bulk_processed)"
          + id          = "priority_delta"
          + label       = "Priority delta"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.priority-inflights-not-being-processed-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "priority-inflights-not-being-processed-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Batch saving priority inflights are being created but are not being processed fast enough. Difference > 50 for 5 minutes"
      + alarm_name                            = "priority-inflights-not-being-processed-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-ok",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "priority_inflight_created"
          + label       = "Priority inflight created"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "created"  = "True"
                  + "priority" = "priority"
                }
              + metric_name = "batch_saving_priority_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "priority_inflight_processed"
          + label       = "Priority inflight processed"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "acknowledged" = "True"
                  + "priority"     = "priority"
                }
              + metric_name = "batch_saving_priority_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ABS(priority_inflight_created - priority_inflight_processed)"
          + id          = "priority_delta"
          + label       = "Priority delta"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.priority_inflights-not-being-processed-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "priority_inflights-not-being-processed-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Batch saving priority inflights are being created but are not being processed fast enough. Difference > 100 for 5 minutes"
      + alarm_name                            = "priority-inflights-not-being-processed-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-ok",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "priority_inflight_created"
          + label       = "Priority inflight created"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "created"  = "True"
                  + "priority" = "priority"
                }
              + metric_name = "batch_saving_priority_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "priority_inflight_processed"
          + label       = "Priority inflight processed"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "acknowledged" = "True"
                  + "priority"     = "priority"
                }
              + metric_name = "batch_saving_priority_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ABS(priority_inflight_created - priority_inflight_processed)"
          + id          = "priority_delta"
          + label       = "Priority delta"
          + return_data = true
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ses_receiving_emails"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-ses-delivery-receipts-errors-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-sns-delivery-receipts-errors-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
